Repository: Orange-OpenSource/ouds-ios
Catalog: DesignToolbox/DesignToolbox/Resources/Localizable.xcstrings
Source language: en
Languages: ar, fr

# app_about_accessibilityStatement_label
source: Accessibility statement
ar: بيان إمكانية الوصول
fr: Déclaration d'accessibilité

# app_about_appSettings_hint_a11y
source: Tap twice to go to app settings
ar: انقر مرتين للانتقال إلى إعدادات التطبيق
fr: Appuyez deux fois pour accéder aux paramètres de l'application

# app_about_appSettings_label
source: Open app settings
ar: افتح إعدادات التطبيق
fr: Ouvrir les paramètres de l'application

# app_about_details_appVersion
source: App version: %@
ar: إصدار التطبيق: %@
fr: Version de l’app : %@

# app_about_details_buildNumber
source: Build number: %@
ar: رقم البناء: %@
fr: Numéro du build : %@

# app_about_details_buildType
source: Build type: %@
ar: نوع البناء: %@
fr: Type de build : %@

# app_about_details_githubBuildDetails
source: Build details (GitHub): %@
ar: تفاصيل البناء (GitHub): %@
fr: Détails du build (GItHub) : %@

# app_about_legalInformation_label
source: Legal information
ar: المعلومات القانونية
fr: Informations légales

# app_about_privacyPolicy_label
source: Privacy policy
ar: سياسة الخصوصية
fr: Politique de confidentialité

# app_bottomBar_about_label
source: About
ar: عن
fr: À propos

# app_bottomBar_components_label
source: Components
ar: عناصر
fr: Composants

# app_bottomBar_tokens_label
source: Tokens
ar: الرموز

# app_common_configuration_label
source: Configuration
ar: إعدادات

# app_common_copyCode_a11y
source: Copy code
ar: نسخ الكود
fr: Copier le code

# app_common_customize_label
source: Customize
ar: تخصيص
fr: Personnaliser

# app_common_enabled_label
source: Enabled
ar: مُمَكَّن
fr: Actif

# app_common_showCode_text
source: View token code example
ar: عرض مثال رمز الرمز المميز
fr: Voir l'exemple de code du token

# app_common_showCode_text_a11y
source: Toggle code visibility
ar: تبديل رؤية الكود
fr: Basculer la visibilité du code

# app_component_emptyContent_description_text
source: This content is under construction and will be available very soon
ar: هذا المحتوى قيد الإنشاء وسيكون متاحًا قريبًا جدًا
fr: Ce contenu est en cours de préparation et sera disponible très prochainement

# app_component_emptyContent_text
source: No content
ar: لا يوجد محتوى
fr: Pas de contenu

# app_components_button_description_text
source: Buttons allow users to make choices or perform an action. They have multiple styles for various needs.
ar: تتيح الأزرار للمستخدمين اختيار ما يريدونه أو تنفيذ إجراء ما. وتتوفر بأنماط متعددة لتلبية احتياجات متنوعة.
fr: Les boutons permettent aux utilisateurs de faire des choix ou d'effectuer une action. Ils ont plusieurs styles pour divers besoins.

# app_components_button_hierarchy_label
source: Hierarchy
ar: تَسَلسُل
fr: Hiérarchie

# app_components_button_icon_a11y
source: Icon
ar: رمز
fr: Icône

# app_components_button_iconOnlyLayout_label
source: Icon only
ar: أيقونة فقط
fr: Icône seul

# app_components_button_label
source: Button
ar: زر
fr: Bouton

# app_components_button_negative_hierary_notAllowed_text
source: Not allowed on colored surface
ar: غير مسموح به على الأسطح الملونة
fr: Non autorisé sur fond de couleur

# app_components_checkbox_checkboxItem_label
source: Checkbox item
ar: عنصر مربع الاختيار الخاص بالحالتين
fr: Case à cocher dans une liste

# app_components_checkbox_controlItem_description_text
source: Checkboxes allows users to select one or multiple options from a list, toggle settings on or off, or confirm an action.
ar: تتيح مربعات الاختيار للمستخدمين تحديد خيار واحد أو خيارات متعددة من القائمة، أو تشغيل الإعدادات أو إيقاف تشغيلها، أو تأكيد إجراء ما.
fr: Les cases à cocher permettent aux utilisateurs de sélectionner une ou plusieurs options dans une liste, d'activer ou de désactiver les paramètres ou de confirmer une action.

# app_components_checkbox_description_text
source: Checkboxes allows users to select one or multiple options from a list, toggle settings on or off, or confirm an action.
ar: تتيح مربعات الاختيار للمستخدمين تحديد خيار واحد أو خيارات متعددة من القائمة، أو تشغيل الإعدادات أو إيقاف تشغيلها، أو تأكيد إجراء ما.
fr: Les cases à cocher permettent aux utilisateurs de sélectionner une ou plusieurs options dans une liste, d'activer ou de désactiver les paramètres ou de confirmer une action.

# app_components_checkbox_hint_a11y
source: This is a fake label used in the demo app
ar: هذه علامة مزيفة مستخدمة في التطبيق التجريبي
fr: Ceci est un label bidon pour l’app de démo

# app_components_checkbox_indeterminateCheckbox_label
source: Indeterminate checkbox
ar: مربع الاختيار الخاص بثلاث حالات فقط
fr: Case à cocher indéterminée

# app_components_checkbox_indeterminateCheckboxItem_label
source: Indeterminate checkbox item
ar: عنصر مربع الاختيار ثلاثي الحالات
fr: Case à cocher indéterminée dans une liste

# app_components_checkbox_indicatorOnly_label
source: Checkbox
ar: خانة الاختيار
fr: Case à cocher seule

# app_components_checkbox_label
source: Checkbox
ar: خانة الاختيار
fr: Case à cocher

# app_components_checkbox_label_text
source: Label
ar: ملصق

# app_components_checkbox_layout_label
source: Layout
ar: تَخطِيط
fr: Disposition

# app_components_checkbox_selection_label
source: Selection
ar: اختيار
fr: Sélection

# app_components_checkbox_threeState_controlItem_description_text
source: Indeterminate checkboxes allows users for example within a folder and file tree structure to select, unselect or partially select one or multiple items.
ar: تتيح مربعات الاختيار غير المحددة للمستخدمين، على سبيل المثال، داخل بنية المجلد وشجرة الملفات تحديد أو إلغاء تحديد أو تحديد جزئي لعنصر واحد أو عناصر متعددة.
fr: La case à cocher indéterminée est utilisée dans des structures de dossier et de fichiers ou l’utilisateur peut sélectionner, désélectionner ou sélectionner partiellement certains éléments.

# app_components_checkbox_threeStates_description_text
source: Indeterminate checkboxes allows users for example within a folder and file tree structure to select, unselect or partially select one or multiple items.
ar: تسمح مربعات الاختيار غير المحددة للمستخدمين على سبيل المثال داخل بنية شجرة المجلدات والملفات بتحديد عنصر واحد أو عدة عناصر أو إلغاء تحديدها أو تحديدها جزئيًا.
fr: La case à cocher indéterminée est utilisée dans des structures de dossier et de fichiers ou l’utilisateur peut sélectionner, désélectionner ou sélectionner partiellement certains éléments.

# app_components_checkbox_twoStates_indicatorOnly_label
source: Checkbox
ar: مربع الاختيار الخاص بالحالتين فقط
fr: Case à cocher

# app_components_checkboxPicker_description_text
source: A checkbox picker makes the user able to select between 0 and all items provided in a list
ar: يجعل منتقي خانات الاختيار المستخدم قادرا على التحديد بين 0 وجميع العناصر المتوفرة في القائمة
fr: Un sélecteur de cases à cocher permet à l'utilisateur de sélectionner entre 0 et tous les éléments fournis dans une liste

# app_components_checkboxPicker_label
source: Checkbox picker
ar: منتقي خانات الاختيار
fr: Sélecteur de cases à cocher

# app_components_checkboxPicker_root
source: Your selection
ar: اختياراتك"
fr: Votre sélection

# app_components_coloredSurface_description_text
source: Colored backgrounds use surface colors to maximize the contrast with content. Several components such as buttons or links adapt their display accordingly when they are displayed on colored backgrounds.
ar: تستخدم الخلفيات الملونة ألوانًا سطحية لزيادة التباين مع المحتوى. وتكيف العديد من العناصر، مثل الأزرار والروابط، طريقة عرضها عند عرضها على خلفيات ملونة.
fr: Les arrière-plans colorés utilisent des couleurs de surface pour maximiser le contraste avec le contenu. Plusieurs composants, tels que les boutons ou les liens, adaptent leur affichage en conséquence lorsqu'ils sont affichés sur des arrière-plans colorés.

# app_components_coloredSurface_label
source: Colored background
ar: خلفيات ملونة
fr: Surface colorée

# app_components_common_color_label
source: Color
ar: لون
fr: Couleur

# app_components_common_divider_label
source: Divider
ar: فاصل
fr: Séparateur

# app_components_common_editContent_label
source: Edit content
ar: تعديل المحتوى
fr: Modifier contenu

# app_components_common_enterText_prompt
source: Enter a text
ar: أدخل النص
fr: Entrez un texte

# app_components_common_error_label
source: Error
ar: خطأ
fr: Erreur

# app_components_common_helperText_label
source: Helper
ar: المساعد
fr: Texte d’aide

# app_components_common_iconAndTextLayout_label
source: Icon + text
ar: أيقونة + نص
fr: Icône + texte

# app_components_common_label_label
source: Label
ar: ملصق

# app_components_common_layout_label
source: Layout
ar: تَخطِيط
fr: Variants

# app_components_common_onColoredSurface_label
source: On colored surface
ar: على خلفية ملونة
fr: Sur fond de couleur

# app_components_common_onError_label
source: Error
ar: خطأ
fr: Erreur

# app_components_common_orientation_label
source: Layout
ar: تَخطِيط
fr: Orientation

# app_components_common_readOnly_label
source: Read only
ar: للقراءة فقط
fr: Lecture seule

# app_components_common_style_label
source: Style
ar: أسلوب

# app_components_common_textOnlyLayout_label
source: Text only
ar: نص فقط
fr: Texte seul

# app_components_common_userText_label
source: Text
ar: نص
fr: Texte

# app_components_common_viewCodeExample_label
source: View component code example
ar: عرض مثال على كود المكون
fr: Voir l'exemple de code du composant

# app_components_controlItem_divider_label
source: Divider
ar: فاصل
fr: Séparateur

# app_components_controlItem_flipIcon_label
source: Flip icon
ar: أيقونة الوجه
fr: Inverser l’icône

# app_components_controlItem_helperText_label
source: Helper text
ar: نص مساعد
fr: Texte d’aide

# app_components_controlItem_icon_label
source: Icon
ar: رمز
fr: Icône

# app_components_controlItem_readOnly_label
source: Read only
ar: للقراءة فقط
fr: Lecture seule

# app_components_controlItem_reversed_label
source: Reversed
ar: معكوس
fr: Inversé

# app_components_divider_description_text
source: A divider visually structures an interface by clearly separating content sections. It helps to improve readability and content organization without introducing a strong hierarchy like a heading or a container would.
ar: يُنظّم الفاصل الواجهة بصريًا من خلال فصل أقسام المحتوى بوضوح. يُحسّن هذا الفاصل سهولة القراءة وتنظيم المحتوى دون الحاجة إلى تسلسل هرمي مُحكم كما هو الحال في العناوين أو الحاويات.
fr: Un séparateur structure visuellement une interface en séparant clairement les sections de contenu. Il améliore la lisibilité et l'organisation du contenu sans introduire une hiérarchie trop marquée comme le feraient un titre ou un conteneur.

# app_components_divider_horizontalDivider_description_text
source: A horizontal Divider is used to separate content laid out one under the other
ar: يتم استخدام الفاصل الأفقي لفصل المحتوى الموضوع تحت الآخر
fr: Le séparateur horizontal est utilisé pour séparer des contenus positionnés côte à côte

# app_components_divider_horizontalDivider_label
source: Horizontal divider
ar: فاصل أفقي
fr: Séparateur horizontal

# app_components_divider_label
source: Divider
ar: فاصل
fr: Séparateur

# app_components_divider_verticalDivider_description_text
source: A vertical Divider is used to separate content in horizontal layout
ar: يتم استخدام الفاصل الرأسي لفصل المحتوى الموضوع جنبًا إلى جنب
fr: Le séparateur vertical est utilisé pour séparer des contenus positionnés l’un en dessous de l’autre

# app_components_divider_verticalDivider_label
source: Vertical divider
ar: فاصل عمودي
fr: Séparateur vertical

# app_components_link_backLayout_label
source: Back
ar: خلف
fr: Retour

# app_components_link_description_text
source: Links direct users to other resources or sections, whether internal (within the same application) or external (to a website or document).
ar: تؤدي الروابط إلى توجيه المستخدمين إلى موارد أو أقسام أخرى، سواء داخلية (ضمن نفس التطبيق) أو خارجية (إلى موقع ويب أو مستند).
fr: Les liens dirigent les utilisateurs vers d'autres ressources ou sections, qu'elles soient internes (dans la même application) ou externes (vers un site web ou un document).

# app_components_link_label
source: Link
ar: وصلة
fr: Lien

# app_components_link_nextLayout_label
source: Next
ar: التالي
fr: Suivant

# app_components_link_size_label
source: Size
ar: مقاس
fr: Taille

# app_components_radio_label_text
source: Label
ar: ملصق

# app_components_radioButton_description_text
source: A radio button allows users to select a single option from a set of mutually exclusive choices, typically displayed as a circular input with a label that becomes filled when selected.
ar: يتيح الراديو للمستخدمين اختيار خيار من القائمة.
fr: Les boutons radio permettent aux utilisateurs de sélectionner une option dans une liste.

# app_components_radioButton_hint_a11y
source: This is a fake label used in the demo app
ar: هذه علامة مزيفة مستخدمة في التطبيق التجريبي
fr: Ceci est un label bidon pour l’app de démo

# app_components_radioButton_label
source: Radio button
ar: راديو بوتون
fr: Bouton radio

# app_components_radioButton_radioButton_label
source: Radio button
ar: مؤشر فقط
fr: Bouton radio

# app_components_radioButton_radioButtonItem_additionalLabel_label
source: Additional label
ar: نص الملصق الإضافي
fr: Label supplémentaire

# app_components_radioButton_radioButtonItem_description_text
source: Radio buttons allow users to select one option from a list.
ar: تسمح أزرار الاختيار للمستخدمين بتحديد خيار واحد من القائمة.
fr: Les boutons radio permettent aux utilisateurs de sélectionner une options dans une liste.

# app_components_radioButton_radioButtonItem_label
source: Radio button item
ar: عنصر زر الاختيار
fr: Bouton radio dans une liste

# app_components_radioButton_radioButtonItem_outlined_label
source: Outlined
ar: مخطط تفصيلي
fr: Encadré

# app_components_radioButton_selection_label
source: Selection
ar: اختيار
fr: Sélection

# app_components_radioPicker_description_text
source: Radio picker allows users to chose on item within a group of many radio buttons
ar: يسمح منتقي الراديو للمستخدمين بالاختيار على عنصر ضمن مجموعة من العديد من العناصر الأخرى باستخدام أزرار الاختيار
fr: Le sélecteur de radio permet aux utilisateurs de choisir un élément au sein d'un groupe de plusieurs boutons radio

# app_components_radioPicker_label
source: Radio picker
ar: منتقي الراديو
fr: Sélecteur de boutons radio

# app_components_switch_description_text
source: A switch allows user to enable or disable a feature, option, or setting.
ar: يتيح المفتاح للمستخدم تمكين أو تعطيل الميزات أو الخيارات أو الإعدادات.
fr: Un switch permet aux utilisateurs d’activer ou désactiver une fonctionnalité, une option ou un paramètre.

# app_components_switch_label
source: Switch
ar: التبديل

# app_components_switch_label_text
source: Label
ar: ملصق

# app_components_switch_selection_label
source: Selection
ar: اختيار
fr: Sélection

# app_components_switch_switch_label
source: Switch
ar: يُحوّل

# app_components_switch_switchItem_description_text
source: Swith allows user to enable or disable features, options, or settings.
ar: يتيح المفتاح للمستخدم تمكين أو تعطيل الميزات أو الخيارات أو الإعدادات.
fr: Un switch permet aux utilisateurs d’activer ou désactiver une fonctionnalité, une option ou un paramètre.

# app_components_switch_switchItem_label
source: Switch item
ar: تبديل العنصر
fr: Switch enrichi

# app_tokens_border_description_text
source: Borders are used for the stroke colours on components and also for the colours of divider lines for components like tables.
ar: يتم استخدام الحدود لألوان الخطوط على المكونات وكذلك لألوان خطوط التقسيم للمكونات مثل الجداول.
fr: Les bordures sont utilisées pour les couleurs de contour sur les composants et pour les couleurs des lignes de séparation pour des composants comme les tableaux.

# app_tokens_border_label
source: Border
ar: حدود
fr: Bordure

# app_tokens_border_radius_label
source: Radius
ar: نصف القطر
fr: Rayon

# app_tokens_border_style_label
source: Style
ar: أسلوب

# app_tokens_border_width_label
source: Width
ar: عرض
fr: Largeur

# app_tokens_color_description_text
source: Colour reinforces our brand identity and ensures consistency across all product experiences. The semantic tokens described are the onse you should use when building a mobile app.
ar: يُعزز اللون هوية علامتنا التجارية ويضمن الاتساق في جميع تجارب المنتجات. الرموز الدلالية المذكورة هي ما يُنصح باستخدامه عند إنشاء تطبيق جوال.
fr: La couleur renforce notre identité de marque et assure la cohérence à travers toutes les expériences produit. Les tokens sémantiques décrits sont ceux que vous devez utiliser lors de la création d'une application mobile.

# app_tokens_color_label
source: Color
ar: لون
fr: Couleur

# app_tokens_common_viewCodeExample_label
source: View token code example
ar: عرض مثال رمز الرمز المميز
fr: Voir l'exemple de code du token

# app_tokens_dimension_description_text
source: Dimension provides standard sizing and spacing to ensure visual consistency across the UI.
ar: يوفر البعد أحجامًا ومسافات قياسية لضمان الاتساق البصري عبر واجهة المستخدم.
fr: La dimension fournit des tailles et des espacements standard pour assurer la cohérence visuelle à travers l'interface utilisateur.

# app_tokens_dimension_label
source: Dimension
ar: البعد

# app_tokens_dimension_size_description_text
source: Size refers to the specific measurements used to define the dimensions of UI elements within the design system.
ar: يشير الحجم إلى القياسات المحددة المستخدمة لتحديد أبعاد عناصر واجهة المستخدم ضمن نظام التصميم.
fr: La taille fait référence aux mesures spécifiques utilisées pour définir les dimensions des éléments de l'interface utilisateur dans le système de design.

# app_tokens_dimension_size_iconDecorative_label
source: Icon decorative
ar: أيقونة زخرفية
fr: Icône décorative

# app_tokens_dimension_size_iconWith_label
source: Icon with
ar: أيقونة مع
fr: Icône avec

# app_tokens_dimension_size_label
source: Size
ar: مقاس
fr: Taille

# app_tokens_dimension_space_columnGap_label
source: Column gap
ar: فجوة مضمنة
fr: Espacement extérieur entre éléments côte à côte

# app_tokens_dimension_space_columnGapHeader_text
source: Column gap includes the vertical spacing between objects.
ar: تتضمن فجوة العمود المسافة الرأسية بين الكائنات.
fr: L'espacement des colonnes comprend l'espacement vertical entre les objets.

# app_tokens_dimension_space_description_text
source: Space refers to the measurements used to define the spacing between UI elements.
ar: تشير المساحة إلى القياسات المستخدمة لتحديد المسافة بين عناصر واجهة المستخدم.
fr: L'espace fait référence aux mesures utilisées pour définir l'espacement entre les éléments de l'interface utilisateur.

# app_tokens_dimension_space_fixed_label
source: Fixed
ar: مُثَبَّت
fr: Fixe

# app_tokens_dimension_space_fixedHeader_text
source: Fixed spacing refers to a constant distance between elements that remains the same regardless of factors like container size, screen resolution, or layout changes.
ar: تشير المسافة الثابتة إلى مسافة ثابتة بين العناصر تظل كما هي بغض النظر عن عوامل مثل حجم الحاوية أو دقة الشاشة أو تغييرات التخطيط.
fr: L'espacement fixe fait référence à une distance constante entre les éléments qui reste la même quels que soient des facteurs tels que la taille du conteneur, la résolution de l'écran ou les changements de mise en page.

# app_tokens_dimension_space_label
source: Space
ar: فضاء
fr: Espace

# app_tokens_dimension_space_paddingInline_label
source: Padding inline
ar: الحشو المضمن
fr: Espacement intérieur gauche droite

# app_tokens_dimension_space_paddingInlineHeader_text
source: Padding inline includes the left and right padding of an object or a group of objects.
ar: تتضمن الحشوة المضمنة الحشوة اليمنى واليسرى لكائن أو مجموعة من الكائنات.
fr: Le remplissage en ligne inclut le remplissage gauche et droit d'un objet ou d'un groupe d'objets.

# app_tokens_dimension_space_paddingInset_label
source: Padding inset
ar: حشوة داخلية
fr: Espacement intérieur

# app_tokens_dimension_space_paddingInsetHeader_text
source: Padding inset includes the left, right, top, and bottom padding, with all parameters being equal.
ar: تتضمن الحشوة المضمنة الحشوة اليسرى واليمنى والعلوية والسفلية، مع تساوي جميع المعلمات.
fr: Le remplissage inséré comprend le remplissage gauche, droit, supérieur et inférieur, tous les paramètres étant égaux.

# app_tokens_dimension_space_paddingStack_label
source: Padding stack
ar: كومة الحشو
fr: Espacement intérieur haut bas

# app_tokens_dimension_space_paddingStackHeader_text
source: Padding stack includes the top and bottom padding.
ar: تتضمن مجموعة الحشو الحشو العلوي والسفلي.
fr: La pile de rembourrage comprend le rembourrage supérieur et inférieur.

# app_tokens_dimension_space_rowGap_label
source: Row gap
ar: كومة الفجوة
fr: Espacement extérieur entre éléments empilés

# app_tokens_dimension_space_rowGapHeader_text
source: Row gap includes the horizontal spacing between objects.
ar: تتضمن فجوة الصفوف المسافة الأفقية بين الكائنات.
fr: L'espacement des rangées comprend l'espacement horizontal entre les objets.

# app_tokens_dimension_space_scaled_label
source: Scaled
ar: مقياس
fr: Échelonné

# app_tokens_dimension_space_scaledHeader_text
source: Scaled spacing refers to spacing that adjusts dynamically based on factors like container size, screen resolution, or layout elements.
ar: تشير المسافة المقاسة إلى المسافة التي يتم تعديلها ديناميكيًا استنادًا إلى عوامل مثل حجم الحاوية أو دقة الشاشة أو عناصر التخطيط.
fr: L'espacement mis à l'échelle fait référence à un espacement qui s'ajuste de manière dynamique en fonction de facteurs tels que la taille du conteneur, la résolution de l'écran ou les éléments de mise en page.

# app_tokens_elevation_description_text
source: Shadows are used to give the impression of distance or elevation between surfaces, which adds depth to our designs.
ar: يتم استخدام الظلال لإعطاء انطباع بالمسافة أو الارتفاع بين الأسطح، مما يضيف عمقًا إلى تصميماتنا.
fr: Les ombres sont utilisées pour donner l'impression de distance ou d'élévation entre les surfaces, ce qui ajoute de la profondeur à nos designs.

# app_tokens_elevation_label
source: Elevation
ar: ارتفاع
fr: Elévation

# app_tokens_grid_description_text
source: Grids are used to position content and create consistent page layouts
ar: يتم استخدام الشبكات لتحديد موضع المحتوى وإنشاء تخطيطات صفحات متسقة
fr: Les grilles sont utilisées pour positionner le contenu et créer des mises en page de page cohérentes.

# app_tokens_grid_label
source: Grid
ar: شبكة
fr: Grille

# app_tokens_opacity_description_text
source: Opacity can help distinguish foreground elements from background elements, making content easier to read and important actions more noticeable.
ar: يمكن أن تساعد العتامة في التمييز بين عناصر المقدمة وعناصر الخلفية، مما يجعل المحتوى أسهل في القراءة والإجراءات المهمة أكثر وضوحًا.
fr: L'opacité peut aider à distinguer les éléments de premier plan des éléments d'arrière-plan, rendant le contenu plus facile à lire et les actions importantes plus visibles.

# app_tokens_opacity_label
source: Opacity
ar: العتامة
fr: Opacité

# app_tokens_typography_description_text
source: Font is our system of fonts and text styles. They enhance communication and reinforce the brand style.
ar: الخط هو نظامنا من الخطوط وأنماط النصوص. يُحسّن هذا النظام التواصل ويُعزز أسلوب علامتنا التجارية.
fr: La typographie est notre système de polices de caractère et de styles de texte. Ils améliorent la communication et renforcent le style de la marque.

# app_tokens_typography_familyAttribute
source: family (%@),
ar: عائلة (%@)،

# app_tokens_typography_label
source: Font
ar: يصنع
fr: Police de caractère

# app_tokens_typography_letterSpacingAttribute
source: letterSpacing (%.2f)
ar: تباعد الأحرف (%.2f)

# app_tokens_typography_lineHeightAttribute
source: lineHeight (%.2f),
ar: تباعد الأحرف (%.2f)

# app_tokens_typography_sizeAttribute
source: size (%.2f),
ar: الحجم (%.2f)،

# app_tokens_typography_weightAttribute
source: weight (%lld),
ar: الوزن (%lld)،
